cf/ChartsOfCharacteristicTypes/НастройкиПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>НастройкиПрофилей</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Должности</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
				<v8:Type>cfg:CatalogRef.Роли</v8:Type>
				<v8:Type>cfg:CatalogRef.События</v8:Type>
				<v8:Type>cfg:CatalogRef.Матрицы</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>255</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоТаблица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписейПрофиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователя</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/Enums/ВидыЗаписейПрофиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыЗаписейПрофиля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоиНастройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфигуратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегСведенийПоПользователю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/НастройкиПрофилей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьСписокВыбора()
	
	Список = Элементы.Путь.СписокВыбора;
	Список.Очистить();
	
	Если Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.Пользователь Тогда
		
		МетаРевизы = Метаданные.Справочники.Пользователи.Реквизиты;
		Для Каждого МетаРекв ИЗ МетаРевизы Цикл Список.Добавить(МетаРекв.Имя) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.МоиНастройки Тогда
		
		Запрос 	= Новый Запрос("
		|ВЫБРАТЬ 
		|	Ссылка,
		|	ВЫБОР КОГДА Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователя.ПустаяСсылка)
		|		ТОГДА ""["" + Родитель.Наименование + ""] "" + Наименование
		|		ИНАЧЕ Наименование 
		|	КОНЕЦ КАК Наименование
		|ИЗ 
		|	ПланВидовХарактеристик.НастройкиПользователя 
		|ГДЕ 
		|	НЕ ПометкаУДаления И Не ЭтоГруппа
		|");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл Список.Добавить(Выборка.Ссылка, Выборка.Наименование) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.РегСведенийПоПользователю Тогда
		
		ПодклРегистры = НастройкиПользователя.ПолучитьПодключаемыеРегистрыНастроекПользователя();
		Для Каждого ПодклРегистр Из ПодклРегистры Цикл Список.Добавить(ПодклРегистр.ИмяРегистра, Метаданные.РегистрыСведений[ПодклРегистр.ИмяРегистра]) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.Конфигуратор Тогда
		
		// Соберем роли
		
		Список.Добавить("Роли", 					"Роли в конфигураторе");
		Список.Добавить("ПоказыватьВСпискеВыбора", 	"Показывать в списке выбора");
		
		// Соберем настройки
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаписиПриИзменении(Элемент)
	
	ЗагрузитьСписокВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСписокВыбора();
	
КонецПроцедуры
